# Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
# Значения данных атрибутов должны передаваться при создании экземпляра класса.
# Атрибуты сделать защищенными. Определить метод расчета массы асфальта,
# необходимого для покрытия всего дорожного полотна.
# Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом,
# толщиной в 1 см * чи сло см толщины полотна. Проверить работу метода.
# Например: 20м * 5000м * 25кг * 5см = 12500 т

class Road:
    _mass1 = 25
    _layer = 0.05

    def __init__(self, _lenght, _width):
        total_mass = _lenght * _width * Road._mass1 * Road._layer / 1000
        print(f"Необходимая масса асфальта: {total_mass} тонн")


Road(20, 5000)
